In [31]:
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import csv

In [32]:
data = pd.read_csv('walmart.csv')
data.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,7969

In [33]:
count=len(data)
print(count)

550068

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 10 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category            550068 non-null  int64
 9   Purchase                    550068 non-null  int64
dtypes: int64(5), object(5)
memory usage: 42.0+ MB

In [35]:
## example how to convert data types: total_rows['ColumnID'] = total_rows['ColumnID'].astype(str)

data['User_ID'] = data['User_ID'].astype(str)
data['Product_ID'] = data['Product_ID'].astype(str)
data['Gender'] = data['Gender'].astype(str)
data['Age'] = data['Age'].astype(str)
data['Occupation'] = data['Occupation'].astype(str)
data['City_Category'] = data['City_Category'].astype(str)
data['Marital_Status'] = data['Marital_Status'].astype(str)
data['Product_Cataegory'] = data['Product_Category'].astype(str)

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  object
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  object
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  object
 8   Product_Category            550068 non-null  int64
 9   Purchase                    550068 non-null  int64
 10  Product_Cataegory           550068 non-null  object
dtypes: int64(2), object(9)
memory usage: 46.2+ MB

In [36]:
#calculate the average purchase price per gender and product category
genderGroupPurchase = data.groupby(['Gender']).mean('Purchase')
genderGroupPurchase = pd.DataFrame(genderGroupPurchase['Purchase'])
genderGroupPurchase

           Purchase
Gender
F       8734.565765
M       9437.526040

In [37]:
#calculate the average purchase price per gender and product category
genderGroupPurchasePC = data.groupby(['Gender', 'Product_Category']).mean('Purchase')
genderGroupPurchasePC

                             Purchase
Gender Product_Category
F      1                 13597.162619
       2                 11407.496819
       3                 10262.656677
       4                  2454.851882
       5                  6307.239532
       6                 15596.428164
       7                 16394.853659
       8                  7499.924787
       9                 15724.314286
       10                19692.076592
       11                 4676.371808
       12                 1422.909269
       13                  733.846785
       14                13747.362761
       15                14695.326960
       16                14681.491257
       17                 9846.403226
       18                 2848.607330
       19                   37.676275
       20                  371.564315
M      1                 13608.164721
       2                 11203.590520
       3                 10026.550081
       4                  2273.512694
       5                  6214.230729
       6                 15907.851009
       7                 16355.789777
       8                  7498.554419
       9                 15498.888235
       10                19670.731264
       11                 4687.425261
       12                 1305.154037
       13                  718.306092
       14                12722.321111
       15                14797.431350
       16                14793.384056
       17                10209.732558
       18                 2990.168793
       19                   36.793403
       20                  370.052545

In [38]:
#calculate average purchase price by Age group
genderGroupAge = data.groupby('Age').mean('Purchase')
genderGroupAge

       Product_Category     Purchase
Age
0-17           5.083764  8933.464640
18-25          5.111088  9169.663606
26-35          5.314272  9252.690633
36-45          5.494242  9331.350695
46-50          5.742194  9208.625697
51-55          5.774214  9534.808031
55+            6.066313  9336.280459

In [42]:
#calculate total purchase price by Age group
genderGroupAgeSum = data.groupby('Age').sum('Purchase')
genderGroupAgeSum

       Product_Category    Purchase
Age
0-17              76775   134913183
18-25            509371   913848675
26-35           1166945  2031770578
36-45            604438  1026569884
46-50            262424   420843403
51-55            222313   367099644
55+              130450   200767375

In [39]:
#calculate purchase price by occupation
genderGroupOcc = data.groupby('Occupation').mean('Purchase')
genderGroupOcc

            Product_Category     Purchase
Occupation
0                   5.433442  9124.428588
1                   5.677245  8953.193270
10                  4.973550  8959.355375
11                  5.593993  9213.845848
12                  5.175663  9796.640239
13                  6.072723  9306.351061
14                  5.281592  9500.702772
15                  5.278833  9778.891163
16                  5.519491  9394.464349
17                  5.056115  9821.478236
18                  5.600725  9169.655844
19                  5.517315  8710.627231
2                   5.645253  8952.481683
20                  5.670312  8836.494905
3                   5.594334  9178.593088
4                   5.186757  9213.980251
5                   5.144371  9333.149298
6                   5.610464  9256.535691
7                   5.414422  9425.728223
8                   4.681113  9532.592497
9                   5.486091  8637.743761

In [44]:
#create dataframe with averasge purchase price by age

Age_purchase=genderGroupAge['Purchase']
Age_purchase = pd.DataFrame(Age_purchase)
Age_purchase

          Purchase
Age
0-17   8933.464640
18-25  9169.663606
26-35  9252.690633
36-45  9331.350695
46-50  9208.625697
51-55  9534.808031
55+    9336.280459

In [41]:
#calculate average purchase price by CIty Category
genderGroupCity = data.groupby('City_Category').mean('Purchase')
genderGroupCity

               Product_Category     Purchase
City_Category
A                      5.506275  8911.939216
B                      5.376181  9151.300563
C                      5.354176  9719.920993

In [ ]:
#Total spend by Marital Status - generally, copy from the Male female spend overview.  Bar Chart. (Amy)

In [ ]:
#Total spend per product category - (Anna)

In [ ]:
# average spend per category (Anna)

In [ ]:
# average spend per marital status, 0 is not moarried, 1 is married (Charisse)

In [ ]:
#Total spend per city by product category (Magdalene)

In [ ]:
# overviewe of category and marital status (Amy)

In [ ]:
# Total spend by occupation  (Charisse)

In [ ]:
# Stay_In_Current_City_Year per product, average spend (Magdalene)